Revit 2024 API
StairsPathType.StartSymbolTypeId Property
 The start symbol type of stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId StartSymbolTypeId { get; set; }
Visual Basic
Public Property StartSymbolTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ StartSymbolTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The startSymbolTypeId is not a valid start symbol type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace